class PagesController < ApplicationController
  def main
    str="Lorem ipsum dolor sit amet, consectetur adipisicing elit. Praesentium, illo"
    @calendar=[]
    sluzhb={ time: "8:00", title: "Часы. Божественная Литургия" }
    sluzhbs=[sluzhb, sluzhb]
    
    1.upto(30).each do |i|
      calday={mday: (i.to_s + ' октября').upcase , saints: str, color: 'red', services: [sluzhb, sluzhb]}
      @calendar << calday
      @calendar = [
      {mday: '3 ОКТЯБРЬЯ',  wday: "среда",
      saints: 'Вмч. Квстафия Плакиды, и жены его Феопистии и чад их. <b>Мчч. и испп. Михаила кн. Черниговского, и болярина его Феодора, чудотворцев.</b>',
      color: "none", 
      services: [
        {time: "7:30", title: "Исповедь"},{time: "8:00", title: "Часы. Божественная Литургия"},
        {time: "16:30", title: "Исповедь"},{time: "17:00", title: "Вечерня и Утреня (полиелей)."}
        ]
      },
      {mday: '4 ОКТЯБРЬЯ',  wday: "четверг",
      saints: '<b>Отдание праздника Воздвижения Животворящего Креста Господня. Обретение мощей свт. Димитрия Ростовского.</b>',
      color: "purple", 
      services: [
        {time: "7:30", title: "Исповедь"},{time: "8:00", title: "Часы. Божественная Литургия"},
        {time: "16:30", title: "Исповедь"},{time: "17:00", title: "Вечерня и Утреня."}
        ]
      },
      {mday: '5 ОКТЯБРЬЯ', wday: "пятница",
      saints: 'Прор. Ионы. Прп. Ионы пресвитера, отца свв. Феофана, творца канонов, и Феодора Начертанных.',
      color: "none", 
      services: [
        {time: "8:30", title: "Исповедь"},{time: "9:00", title: "Часы. Божественная Литургия"},
        {time: "16:30", title: "Исповедь"},{time: "17:00", title: "Вечерня и Утреня."}
        ]
      },
      {mday: '6 ОКТЯБРЬЯ',  wday: "суббота",
      saints: 'Зачатие честного, славного Пророка, Предтечи и Крестителя Иоанна.
                <b>Прославление свт. Иннокентия митр. Московского.</b>',
      color: "none", 
      services: [
        {time: "7:30", title: "Исповедь"},{time: "8:00", title: "Часы. Божественная Литургия"},
        {time: "14:00", title: "Молебен вмч. Пантелеимону."},
        {time: "15:30", title: "Исповедь"},{time: "16:00", title: "Вечерня и Утреня."}
        ]
      },
      {mday: '7 ОКТЯБРЬЯ',  wday: "воскресение",
      saints: 'Первомц. равнап. Феклы. Прп. Корпия. Св. царя Стефана и сына его св. царя Владислава',
      color: "gold", 
      services: [
        {time: "6:00", title: "Исповедь"},{time: "6:30", title: "Часы. Божественная Литургия <i>(«Иверский» храм)</i>"},
        {time: "", title: "Молебен"},
        {time: "9:00", title: "Исповедь"},{time: "9:30", title: "Часы. Божественная Литургия <i>(верхний «Георгиевский» храм)</i>"},
        {time: "14:00", title: "Молебен вмч. Пантелеимону."},
        {time: "15:30", title: "Исповедь"},{time: "16:00", title: "Всенощное бдение с литией."}
        ]
      },
      {mday: '8 ОКТЯБРЬЯ',  wday: "понедельник",
      saints: '<b>Преставление прп. Сергия, игумена  Радонежского, и всея России Чудотворца</b>',
      color: "green", 
      services: [
        {time: "6:00", title: "Исповедь"},{time: "6:30", title: "Часы. Божественная Литургия <i>(«Иверский» храм)</i>"},
        {time: "", title: "Молебен"},
        {time: "9:00", title: "Исповедь"},{time: "9:30", title: "Часы. Божественная Литургия <i>(«Сергиевский придел»  верхнего «Георгиевского» храма)</i>"},
        {time: "15:30", title: "Исповедь"},{time: "16:00", title: "Вечерня и Утреня (полиелей)."}
        ]
      },
      {mday: '9 ОКТЯБРЬЯ', wday: "вторник",
      saints: 'Преставление апостола и евангелиста Иоанна Богослова. Свт. Тихона, патриарха Московского и всея Руси. .',
      color: "red", 
      services: [
        {time: "7:30", title: "Исповедь"},{time: "8:00", title: "Часы. Божественная Литургия"},
        {time: "16:30", title: "Исповедь"},{time: "17:00", title: "Вечерня и Утреня (полиелей)."}
        ]
      },
      {mday: '10 ОКТЯБРЬЯ', wday: "среда",
      saints: '<b>Сщмч. Петра, митр. Крутицкого.</b> Мч. Каллистрата.',
      color: "none", 
      services: [
        {time: "7:30", title: "Исповедь"},{time: "8:00", title: "Часы. Божественная Литургия"},
        {time: "16:30", title: "Исповедь"},{time: "17:00", title: "Вечерня и Утреня (полиелей)."}
        ]
      },
      {mday: '11 ОКТЯБРЬЯ', wday: "четверг",
      saints: 'Прп. Харитона Исповедника. Прпп. схимонаха Кирилла и схимонахини Марии, 
      родителей прп. Сергия Радонежского.',
      color: "none", 
      services: [
        {time: "7:30", title: "Исповедь"},{time: "8:00", title: "Часы. Божественная Литургия"},
        {time: "16:30", title: "Исповедь"},{time: "17:00", title: "Вечерня и Утреня (полиелей)."}
        ]
      },
      {mday: '12 ОКТЯБРЬЯ', wday: "пятница",
      saints: 'Прп. Кириака отшельника. Прп. Феофана Милостивого. Сщмч.Иоанна, архиеп. Рижского.',
      color: "none", 
      services: [
        {time: "7:30", title: "Исповедь"},{time: "8:00", title: "Часы. Божественная Литургия"},
        {time: "16:30", title: "Исповедь"},{time: "17:00", title: "Вечерня и Утреня (полиелей)."}
        ]
      },
      ]
    end
  end
end
